# словарь это ассоциативный список
my_box = {}
my_box['слон'] = 'элефант'
my_box
my_box['машина'] = 'rav4'

my_box = {}
   ...: my_box['слон'] = 'элефант'
   ...: my_box
Out[13]: {'слон': 'элефант'}
my_box['машина'] = 'rav4'
my_box
Out[15]: {'слон': 'элефант', 'машина': 'rav4'}

my_box['3.1415926'] = 'rav4'
my_box
Out[17]: {'слон': 'элефант', 'машина': 'rav4', '3.1415926': 'rav4'}
my_box['3.1415926'] = 'пи'
my_box
Out[19]: {'слон': 'элефант', 'машина': 'rav4', '3.1415926': 'пи'}
# складывать умножать и тд нельзя

# вхождение в словарь in
77 in my_box
Out[21]: False
'слон' in my_box
Out[22]: True

my_box['слон'] # получение значения по ключу
Out[23]: 'элефант'

my_box['кот'] # получение значения по ключу которого нет в словаре,
my_box.get('кот', 'murzik')
Out[25]: 'murzik'
my_box.get('слон', 'murzik')
Out[26]: 'элефант'
my_box
Out[27]: {'слон': 'элефант', 'машина': 'rav4', '3.1415926': 'пи'} # словарь не меняется

my_box.setdefault('кот', 'murzik') # получение значения по ключу которого нет в словаре,
Out[28]: 'murzik'
my_box
Out[29]: {'слон': 'элефант', 'машина': 'rav4', '3.1415926': 'пи', 'кот': 'murzik'} # словарь меняется



















